app/controllers/reviews_controller.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 1]]
---
  def destroy
    review = Review.find(params[:id])
    review.destroy

INSERT INTO "reviews" ("vendor_name", "title", "rating", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
---
    def create
        @review = Review.new(review_params)
        if @review.save

SELECT "reviews".* FROM "reviews" WHERE "reviews"."vendor_id" = ?  [["vendor_id", 4]]
---
    def show_vendor_reviews
        vendor_id = params[:vendor_id]
        @vendor_reviews = Review.vendor_reviews(vendor_id)
        if @vendor_reviews.blank?