app/controllers/services_controller.rb

INSERT INTO "services" ("title", "description", "price", "poster", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "Laundry Help"], ["description", "desc"], ["price", 15.0], ["poster", "Emily"], ["created_at", "2025-10-28 10:59:31.568663"], ["updated_at", "2025-10-28 10:59:31.568663"]]
---
    def create
        @service = Service.new(service_params)
        if @service.save

SELECT "services".* FROM "services" WHERE "services"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
      @service = Service.find(params[:id])

SELECT "services".* FROM "services" WHERE "services"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "services" WHERE "services"."id" = ?  [["id", 1]]
---
    def destroy
      @service = Service.find(params[:id])
      @service.destroy